#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/KrisCo/Lab-production/runs/run-Rd4V7SKuMWuHsEsk

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
aws_internet_gateway.igw-example: Refreshing state... [id=igw-0bf2c7f82200a0ef6]
aws_vpc.lab: Refreshing state... [id=vpc-0cb0d0e0ccb57366f]
aws_route_table.public-practice-RT: Refreshing state... [id=rtb-0d4503245ed0e8a55]
aws_subnet.public-example-subnet: Refreshing state... [id=subnet-06c73505db33161a2]
aws_security_group.webserver-SG: Refreshing state... [id=sg-09c81368a40fdba80]
aws_route_table_association.public-access: Refreshing state... [id=rtbassoc-0d27631e43a221a52]
aws_instance.EC2: Refreshing state... [id=i-089087ea5e98529af]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.EC2 must be replaced
-/+ resource "aws_instance" "EC2" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:949471431711:instance/i-089087ea5e98529af" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-089087ea5e98529af" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-08de3fbb9d2741b36" -> (known after apply)
      ~ private_dns                          = "ip-142-55-1-14.ec2.internal" -> (known after apply)
      ~ private_ip                           = "142.55.1.14" -> (known after apply)
      ~ public_dns                           = "ec2-3-84-24-214.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "3.84.24.214" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] # forces replacement -> (known after apply)
      ~ subnet_id                            = "subnet-06c73505db33161a2" # forces replacement -> (known after apply)
        tags                                 = {
            "Name" = "EC2-production"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-09c81368a40fdba80",
        ] -> (known after apply)
        # (8 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-07a7e908f8eae43e3" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_internet_gateway.igw-example will be destroyed
  # (because aws_internet_gateway.igw-example is not in configuration)
  - resource "aws_internet_gateway" "igw-example" {
      - arn      = "arn:aws:ec2:us-east-1:949471431711:internet-gateway/igw-0bf2c7f82200a0ef6" -> null
      - id       = "igw-0bf2c7f82200a0ef6" -> null
      - owner_id = "949471431711" -> null
      - tags     = {
          - "Name" = "igw-example"
        } -> null
      - tags_all = {
          - "Name" = "igw-example"
        } -> null
      - vpc_id   = "vpc-0cb0d0e0ccb57366f" -> null
    }

  # aws_internet_gateway.lab will be created
  + resource "aws_internet_gateway" "lab" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "igw-production"
        }
      + tags_all = {
          + "Name" = "igw-production"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route_table.lab will be created
  + resource "aws_route_table" "lab" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "ex_public_rt"
        }
      + tags_all         = {
          + "Name" = "ex_public_rt"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public-practice-RT will be destroyed
  # (because aws_route_table.public-practice-RT is not in configuration)
  - resource "aws_route_table" "public-practice-RT" {
      - arn              = "arn:aws:ec2:us-east-1:949471431711:route-table/rtb-0d4503245ed0e8a55" -> null
      - id               = "rtb-0d4503245ed0e8a55" -> null
      - owner_id         = "949471431711" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-0bf2c7f82200a0ef6"
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name" = "ex_public_rt"
        } -> null
      - tags_all         = {
          - "Name" = "ex_public_rt"
        } -> null
      - vpc_id           = "vpc-0cb0d0e0ccb57366f" -> null
    }

  # aws_route_table_association.public-access must be replaced
-/+ resource "aws_route_table_association" "public-access" {
      ~ id             = "rtbassoc-0d27631e43a221a52" -> (known after apply)
      ~ route_table_id = "rtb-0d4503245ed0e8a55" -> (known after apply)
      ~ subnet_id      = "subnet-06c73505db33161a2" # forces replacement -> (known after apply)
    }

  # aws_security_group.webserver-SG must be replaced
-/+ resource "aws_security_group" "webserver-SG" {
      ~ arn                    = "arn:aws:ec2:us-east-1:949471431711:security-group/sg-09c81368a40fdba80" -> (known after apply)
      ~ id                     = "sg-09c81368a40fdba80" -> (known after apply)
        name                   = "webserver-SG"
      + name_prefix            = (known after apply)
      ~ owner_id               = "949471431711" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      ~ vpc_id                 = "vpc-0cb0d0e0ccb57366f" # forces replacement -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_subnet.lab-public will be created
  + resource "aws_subnet" "lab-public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "production-SN-public"
        }
      + tags_all                                       = {
          + "Name" = "production-SN-public"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public-example-subnet will be destroyed
  # (because aws_subnet.public-example-subnet is not in configuration)
  - resource "aws_subnet" "public-example-subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:949471431711:subnet/subnet-06c73505db33161a2" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az2" -> null
      - cidr_block                                     = "142.55.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-06c73505db33161a2" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "949471431711" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "example-SN-public"
        } -> null
      - tags_all                                       = {
          - "Name" = "example-SN-public"
        } -> null
      - vpc_id                                         = "vpc-0cb0d0e0ccb57366f" -> null
    }

  # aws_vpc.lab must be replaced
-/+ resource "aws_vpc" "lab" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:949471431711:vpc/vpc-0cb0d0e0ccb57366f" -> (known after apply)
      - assign_generated_ipv6_cidr_block     = false -> null
      ~ cidr_block                           = "142.55.0.0/16" -> "10.0.0.0/16" # forces replacement
      ~ default_network_acl_id               = "acl-0d3b853aa33959e37" -> (known after apply)
      ~ default_route_table_id               = "rtb-0152d28682e59d14b" -> (known after apply)
      ~ default_security_group_id            = "sg-07799be082a14b6f0" -> (known after apply)
      ~ dhcp_options_id                      = "dopt-012baeb9d34749847" -> (known after apply)
      ~ enable_classiclink                   = false -> (known after apply)
      ~ enable_classiclink_dns_support       = false -> (known after apply)
      ~ enable_network_address_usage_metrics = false -> (known after apply)
      ~ id                                   = "vpc-0cb0d0e0ccb57366f" -> (known after apply)
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      - ipv6_netmask_length                  = 0 -> null
      ~ main_route_table_id                  = "rtb-0152d28682e59d14b" -> (known after apply)
      ~ owner_id                             = "949471431711" -> (known after apply)
        tags                                 = {
            "Name" = "vpc-production"
        }
        # (4 unchanged attributes hidden)
    }

Plan: 7 to add, 0 to change, 7 to destroy.

Changes to Outputs:
  ~ web-address = "ec2-3-84-24-214.compute-1.amazonaws.com" -> (known after apply)

```

</details>

*Pushed by: @krispigeau, Action: `pull_request`*